app/controllers/api/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = Account.all