app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("name", "birth_date", "photo", "account_bank", "balance", "password_bank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"