app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

INSERT INTO "transactions" ("credit", "debit", "transfer", "value", "account_receive", "account_send", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)

    if @transaction.save